Revit 2027 API
UIDocument.ShowElements(ICollection<ElementId>) Method
Shows the elements by zoom to fit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ShowElements(
	ICollection<ElementId> elementIds
)
Public Sub ShowElements (
	elementIds As ICollection(Of ElementId)
)
public:
void ShowElements(
	ICollection<ElementId^>^ elementIds
)
member ShowElements :
        elementIds : ICollection<ElementId> -> unit
Parameters
elementIds ICollection<ElementId>
The set of element ids which will be shown.
Exceptions
Exception | Condition
ArgumentNullException | elementIds is null.
ArgumentException | Member of elementIds is null.
ArgumentException | Member of elementIds is not valid.
Remarks
Places all the elements on the screen by moving the view.
See Also
Reference
UIDocument Class
ShowElements Overload
Autodesk.Revit.UI Namespace